public class interface1 {
    //less11 4:38
    //באמצעות ממשק אני יכול להוסיף פעולות או יכול לזהות מחלקות לפי השיוך שלהם

    //באינטרפייס יש רק חתימות של פונקציות ללא מימושים
    //דרגעה אחת מעל מחלקה אבסטרקטית ששם יש לך בחירה אם לממש שיטות או לבחור רק חתימות

    // אינטרפייס תמיד יהיה public לכן אני לא חייב לרשום את המודיפייר פובליק בתחילת הקלאס

    //מילה שמורה implements להצהרה על אינטרפחחס במחלקה
    //באמצעות ממשק ניתן להוסיף למחלקות אוסף פעולות
    //  בניגוד להורשה ניתן לעשות כמה אימפלמנטיים שאני רוצה באצעות כתיבת פסיק בין הממשקים
    //public ClassName implements soundAble ,seeAble,flyAble{...}
    //כאשר יורשים ממשק ומחלקה הממשק יבוא לאחר המחלקה לדוגמא :
    //public ClassName extend XabstructClass implements YAble{...
    //אינטרפייס לא יכול ליצור מופעים משל עצמו

    //ממשק הוא מחלקה אבסטרקטית ללא תכונות וכל השיטות אבסטרקטיות כלומר רק חתימות ללא מימושים
    //שם הממשק נהוג שיסתיים בסיומת able
    //ממשק מכיל אוסף של התנהגויות בעלי מכנה משותף

    //למשל אדם ועיגול שניהם ניתנים להדפסה (Printable)
    // אך לא נכון להגיד שאדם הוא סוג של הדפסה ולכן אין זו ירושה
    //שים לב כאשר מחלקה יורשת מחלקה אחרת שממשת ממשק  היא יורשת גם את תכונות הממשק

    //שיחרור צימוד :
    //EladPhoneExLossCo3 ראה דוגמא ב



}
