package priverProblemAtInheritence4;

/*בעיה עם הרשאות פריווט במחלקת הבסיס כי מצד אחד
* רני צריך את הפריווט עמ להגן על הערכים מהמשתמש
* אך מצד שני הבעיה היא שבמידה והערכים במחלקת הבסיס הם פריווט המחלקה היורשת לא תכיר אותם
* למשל הקונסטרקטור במחלקת סטודנט לא יכיר את הערכים במחלקת Person ולכן הוא לא יוכל להשתמש בsuper */
public class privetProblem {

    //מחלקה יורשת מקבלת את כל השיטות מכילה את כל התכונות והשיטות של מחלקת הבסיס
    //אך לא תוכל לגשת אליהם במידה והוגדרו כפריווט ,יכולה לגשת לכל השיטות/תכונות שבpublic


    /* *************************************    */
/*על מנת לפתור את בעית ההרשאות בין מחלקת אב למחלקת בן נצטרך להשתמש בהרשאת PROTECTED*/
    /* *************************************    */
}
